---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures.InvalidExtrusionCurveloop
source: html/a64a84a6-2231-62ac-fb43-31f8ff1b1752.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures.InvalidExtrusionCurveloop Property

Base sketch for extrusion is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidExtrusionCurveloop { get; }
```